Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.kustomization_resource.p0["apiextensions.k8s.io/CustomResourceDefinition/_/applications.argoproj.io"] will be updated in-place
~ resource "kustomization_resource" "p0" {
        id       = "1139fd5c-e4d2-4a29-9b90-2fb72602467b"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.argocd.kustomization_resource.p0["apiextensions.k8s.io/CustomResourceDefinition/_/applicationsets.argoproj.io"] will be updated in-place
~ resource "kustomization_resource" "p0" {
        id       = "7e135c27-5438-4f32-b83b-60461fe682bf"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.argocd.kustomization_resource.p0["apiextensions.k8s.io/CustomResourceDefinition/_/appprojects.argoproj.io"] will be updated in-place
~ resource "kustomization_resource" "p0" {
        id       = "8840d7d9-161f-4393-b744-e61283821a73"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-cm"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "74754cca-985b-46a2-8b61-fce666c1dce1"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-cmd-params-cm"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "9e07adbd-6acd-4c9c-8b2f-fa5a4bc4b55d"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-gpg-keys-cm"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "99da00a7-0310-4cf4-9acc-27a94dd33726"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-notifications-cm"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "ec9fe3f2-14d1-416d-acee-12a7157802df"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-rbac-cm"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "5279d40d-f152-423e-9521-e7aa056b8bb8"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-ssh-known-hosts-cm"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "23b04123-40f3-41cc-b621-7f5bf0b5f1de"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-tls-certs-cm"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "cc3f1283-46d0-4c52-971f-bf2bba501a49"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/cmp-plugin"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "a84b41a8-9813-4fc4-97f7-d44a25a725ad"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-applicationset-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "226942b4-9113-482a-bfcc-25f120b867f2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-dex-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "b73db55e-419b-412b-932d-84750f41bea2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-metrics"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "65071f30-fc63-45bd-9e24-f0691eb9c14a"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-notifications-controller-metrics"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "61ba697e-63a2-45cc-918a-4b16d6633e65"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-redis"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "26ed6154-98b7-4fdd-a3bd-a773beb22a99"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-repo-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "9a43312d-3540-4c97-a798-29f9321012b1"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "17c5d74f-7a0d-4edb-a517-76f3b84dc724"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-server-metrics"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "ae09bfef-bbf2-4b65-ac66-a412a06cb495"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-application-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "d7971350-f8fa-4ac7-9e7c-84dfc61fd8d2"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-applicationset-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "18906ba1-8d72-4456-afdc-9bf1f0c76f87"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-dex-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "2fcd0498-32eb-4fc4-88b5-b74ebd7b6535"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-notifications-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "68c9ea90-97d3-429d-a71c-953fd1bcbfbd"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-redis"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "bd5455bc-4694-4267-abd3-f92fb22cc0bf"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-repo-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "ad8ed7a3-e9ed-40ab-bbb7-1a151d56f473"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "74f6e2e0-e2af-4a5a-8be7-b0ff54326213"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-applicationset-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "0a9c0bcb-1823-450d-b2c0-f55ef402c11f"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-dex-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "bd175ba3-6c14-4e9f-b6d3-9a5fef4cc25e"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-notifications-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "e87eb6a7-046b-4ed0-bb4b-cee11c8a0209"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-redis"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "7f5909f1-7f5a-4435-81d1-efc76a717aab"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-repo-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "9b3b41a8-d2ea-49e0-a062-f93e82e9280b"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "0e151e21-1b0f-48fe-a300-593723793366"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["apps/StatefulSet/argocd/argocd-application-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "d578c576-7b14-4db9-a994-015b4bfa1f8b"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.istio.io/VirtualService/argocd/argocd-vs"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "7a8e230b-09c2-46a6-8792-421a25034965"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-application-controller-network-policy"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "0929825c-4991-4dae-8afe-13f917186306"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-applicationset-controller-network-policy"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "987c0171-af36-4640-a1c7-0eadea877653"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-dex-server-network-policy"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "36816019-219c-4b83-b9fc-a4c5d3907438"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-notifications-controller-network-policy"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "14f390ab-41ef-46bb-9de4-c1ea6fc544bb"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-redis-network-policy"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "02cde0cf-1e20-49b1-9272-788ca39d52e3"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-repo-server-network-policy"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "d9ff3dae-8a6c-45da-9ef3-107fd028f487"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-server-network-policy"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "de987350-4efb-4e84-8fe4-062912fdd5af"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRole/_/argocd-application-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "f783cbf4-ed47-420a-9a6d-8c8908e381f6"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRole/_/argocd-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "0499eeda-52f8-4841-b14d-04cb090acdde"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRoleBinding/_/argocd-application-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "44c15ed9-0c5d-407c-b35d-102a77e2799a"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRoleBinding/_/argocd-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "aaf002a1-5e26-4ef4-8dae-901244b6e727"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-application-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "ccfc9916-a24e-453a-8760-658ef5267af1"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-applicationset-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "7f5b0c63-3944-4f8e-b8f4-2c1fe284c9cf"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-dex-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "83580486-5183-4772-b86d-7e1b1dd609e3"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-notifications-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "7e88abaa-0247-4bb8-abd1-23dcc0abaa67"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-repo-server-role"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "c1942311-34f5-4c25-a747-85bbd813e06b"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "4ac6c42e-7a4f-4a12-ac59-416be5f76b30"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-application-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "93f58dcb-3d12-439b-93be-0714b2aaebc6"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-applicationset-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "0eecdffe-60df-4ecc-b3bf-6c41a3080711"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-dex-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "e9ed058d-97d1-4ca7-9e83-d64b38ec4793"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-notifications-controller"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "4656ca69-2dc8-414e-8f2b-3f2f08abe395"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-redis"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "8eb52b2e-f283-4be2-beb9-9ce37f4888d7"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-repo-server-rolebinding"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "8b29419a-37fd-4e87-b3e5-02bd1d983d4f"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-server"] will be updated in-place
~ resource "kustomization_resource" "p1" {
        id       = "460ac3cd-73b6-42a3-9082-347a98e043ed"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ manifest = (sensitive value)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd-application.argocd_application.fetch-system-streams is tainted, so must be replaced
-/+ resource "argocd_application" "fetch-system-streams" {
      ~ id       = "fetch-system-streams:argocd" -> (known after apply)
      ~ status   = [
          - {
              - conditions      = []
              - health          = [
                  - {
                      - status  = "Progressing"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - operation_state = [
                  - {
                      - finished_at = "2025-02-01 10:56:27 +0000 UTC"
                      - message     = "successfully synced (all tasks run)"
                      - phase       = "Succeeded"
                      - retry_count = "0"
                      - started_at  = "2025-02-01 10:56:27 +0000 UTC"
                    },
                ]
              - reconciled_at   = "2025-02-01 11:10:53 +0000 UTC"
              - resources       = [
                  - {
                      - group            = "apps"
                      - health           = [
                          - {
                              - message = "Waiting for rollout to finish: 0 of 1 updated replicas are available..."
                              - status  = "Progressing"
                            },
                        ]
                      - hook             = false
                      - kind             = "Deployment"
                      - name             = "fetch-system-streams"
                      - namespace        = "fetch-system"
                      - requires_pruning = false
                      - status           = "Synced"
                      - sync_wave        = "0"
                      - version          = "v1"
                    },
                ]
              - summary         = [
                  - {
                      - external_urls = []
                      - images        = [
                          - "docker.io/istio/proxyv2:1.24.2",
                          - "registry.goboolean.io/fetch-system/streams:e755d8b",
                        ]
                    },
                ]
              - sync            = [
                  - {
                      - revision  = "8dde247ecac6ee680fd3c658366ca9a628cbb0d7"
                      - revisions = []
                      - status    = "Synced"
                    },
                ]
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 129 -> (known after apply)
          - labels           = {} -> null
            name             = "fetch-system-streams"
          ~ resource_version = "5547368" -> (known after apply)
          ~ uid              = "18643b06-a8a5-4b53-baa5-8a0d1a9ce04c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ sync_policy {
              - sync_options = [] -> null

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.argocd-application.argocd_application.fetch-system-worker is tainted, so must be replaced
-/+ resource "argocd_application" "fetch-system-worker" {
      ~ id       = "fetch-system-worker:argocd" -> (known after apply)
      ~ status   = [
          - {
              - conditions      = []
              - health          = [
                  - {
                      - status  = "Degraded"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - operation_state = [
                  - {
                      - finished_at = "2025-02-01 10:56:31 +0000 UTC"
                      - message     = "successfully synced (all tasks run)"
                      - phase       = "Succeeded"
                      - retry_count = "0"
                      - started_at  = "2025-02-01 10:56:31 +0000 UTC"
                    },
                ]
              - reconciled_at   = "2025-02-01 11:10:53 +0000 UTC"
              - resources       = [
                  - {
                      - group            = "apps"
                      - health           = [
                          - {
                              - message = "Deployment \"kis-stock\" exceeded its progress deadline"
                              - status  = "Degraded"
                            },
                        ]
                      - hook             = false
                      - kind             = "Deployment"
                      - name             = "kis-stock"
                      - namespace        = "fetch-system"
                      - requires_pruning = false
                      - status           = "Synced"
                      - sync_wave        = "0"
                      - version          = "v1"
                    },
                  - {
                      - group            = "apps"
                      - health           = [
                          - {
                              - message = "Deployment \"polygon-stock\" exceeded its progress deadline"
                              - status  = "Degraded"
                            },
                        ]
                      - hook             = false
                      - kind             = "Deployment"
                      - name             = "polygon-stock"
                      - namespace        = "fetch-system"
                      - requires_pruning = false
                      - status           = "Synced"
                      - sync_wave        = "0"
                      - version          = "v1"
                    },
                ]
              - summary         = [
                  - {
                      - external_urls = []
                      - images        = [
                          - "docker.io/istio/proxyv2:1.24.2",
                          - "registry.goboolean.io/fetch-system/worker:030a6c9",
                        ]
                    },
                ]
              - sync            = [
                  - {
                      - revision  = "8dde247ecac6ee680fd3c658366ca9a628cbb0d7"
                      - revisions = []
                      - status    = "Synced"
                    },
                ]
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 135 -> (known after apply)
          - labels           = {} -> null
            name             = "fetch-system-worker"
          ~ resource_version = "5549339" -> (known after apply)
          ~ uid              = "7381423b-a1ae-4b2a-9a63-ade5fa64a3b6" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (2 unchanged attributes hidden)

          ~ sync_policy {
              - sync_options = [] -> null

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be updated in-place
~ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "34.47.92.167" -> (known after apply)
      ~ created_on          = "2025-01-28T12:03:24Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "5b3805bf479bd12a29aad2877a6cfdfa"
      ~ meta                = jsonencode(
            {
              - auto_added             = false
              - managed_by_apps        = false
              - managed_by_argo_tunnel = false
            }
        ) -> (known after apply)
      ~ modified_on         = "2025-01-28T12:03:24Z" -> (known after apply)
        name                = "*.goboolean.io"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gce.google_compute_instance.default will be updated in-place
~ resource "google_compute_instance" "default" {
        id                   = "projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis"
      ~ metadata             = {
          - "ssh-keys" = <<-EOT
                goboolean241225:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBEOwFaiHPjMn2OTkPx/ah5jEsnTo/lT6EifMvXoaFvlz6KDWwyxoQHXyoIxB2pYdPPPpaU7jIeLM1w4wA2b+oLc= google-ssh {"userName":"goboolean241225@gmail.com","expireOn":"2025-02-01T08:09:49+0000"}
                goboolean241225:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC44FDuIq/vju7O3gNNn2QgtqfkhnkwNrVadSq4THVBhgfFht3ED2qeiZpxgvtrREcHXd0Nrlzg5C4W3SO+y9mV7Z2Xo+4NeYyQOd8jmuz9MUkBt3WUXtOH9VTdDuzYCYCEbbK+vOknF06Bn8drv3rt6SGyoEdfYhti3+D79Niw+x09y3gE/olHOzfpwK8dAShmtE6UQcMFpmiV0xnTfZvKuA/hU9hG5xfelm/Dq7IVfkKPZwv5NOqCvkCv9Ggc7HosORHNvrvEAqfr8xOQ5f/GaDweBBEDG3pgnCg7HUG+gUrmL/hKqxjHT+RMJsbIJNU5fPUw2B0TpyhDyE7u5WL/ google-ssh {"userName":"goboolean241225@gmail.com","expireOn":"2025-02-01T08:09:56+0000"}
            EOT -> null
        }
        name                 = "atlantis"
        tags                 = [
            "atlantis-server",
        ]
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.primary_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_nodes" {
      ~ id                          = "projects/goboolean-448812/locations/asia-northeast3-a/clusters/goboolean-448812-gke/nodePools/goboolean-448812-gke" -> (known after apply)
      ~ initial_node_count          = 5 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/goboolean-448812/zones/asia-northeast3-a/instanceGroupManagers/gke-goboolean-448812-goboolean-448812-b0b74df1-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/goboolean-448812/zones/asia-northeast3-a/instanceGroups/gke-goboolean-448812-goboolean-448812-b0b74df1-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "goboolean-448812-gke"
      + name_prefix                 = (known after apply)
      ~ node_locations              = [
          - "asia-northeast3-a",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "goboolean-448812" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ management (known after apply)
      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      ~ network_config (known after apply)

      ~ node_config {
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-1" -> "n1-standard-2" # forces replacement
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "gke-node",
                "goboolean-448812-gke",
            ]
          ~ taint             = [] -> (known after apply)
            # (9 unchanged attributes hidden)

          ~ confidential_nodes (known after apply)

          ~ shielded_instance_config (known after apply)
          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          ~ workload_metadata_config (known after apply)

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings (known after apply)
      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

  # module.istio.data.kubernetes_service.istio_ingressgateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "istio_ingressgateway" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "istio-ingressgateway"
          + namespace        = "istio-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 60 to change, 3 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 60 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
